---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.FlexDuct
source: html/06120bbc-53cc-d429-fe0a-b0a8ff54d85c.htm
---
# FlexDuct Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.